In [1]:
import pandas as pd
import numpy as np

In [26]:
income = pd.read_csv('income.csv')

In [27]:
income.head()

   age      id  education         occupation  hours-per-week income
0   39   77516  Bachelors       Adm-clerical              40  <=50K
1   50   83311  Bachelors    Exec-managerial              13  <=50K
2   38  215646    HS-grad  Handlers-cleaners              40  <=50K
3   53  234721       11th  Handlers-cleaners              40  <=50K
4   28  338409  Bachelors     Prof-specialty              40  <=50K

In [28]:
income.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28641 entries, 0 to 28640
Data columns (total 6 columns):
age               28641 non-null int64
id                28641 non-null int64
education         28641 non-null object
occupation        28641 non-null object
hours-per-week    28641 non-null int64
income            28641 non-null object
dtypes: int64(3), object(3)
memory usage: 1.3+ MB

In [29]:
income['income'].unique()

array(['<=50K', '>50K'], dtype=object)

In [30]:
def incomeLabel(row):
    if row['income'] == '<=50K':
        return 0
    else:
        return 1
    

income['01income'] = income.apply(lambda row:incomeLabel(row), axis = 1)

In [31]:
income.head()

   age      id  education         occupation  hours-per-week income  01income
0   39   77516  Bachelors       Adm-clerical              40  <=50K         0
1   50   83311  Bachelors    Exec-managerial              13  <=50K         0
2   38  215646    HS-grad  Handlers-cleaners              40  <=50K         0
3   53  234721       11th  Handlers-cleaners              40  <=50K         0
4   28  338409  Bachelors     Prof-specialty              40  <=50K         0

In [13]:
income.head(20)

,age,id,education,occupation,hours-per-week,income,01income
0,39,77516,Bachelors,Adm-clerical,40,<=50K,0
1,50,83311,Bachelors,Exec-managerial,13,<=50K,0
2,38,215646,HS-grad,Handlers-cleaners,40,<=50K,0
3,53,234721,11th,Handlers-cleaners,40,<=50K,0
4,28,338409,Bachelors,Prof-specialty,40,<=50K,0
5,37,284582,Masters,Exec-managerial,40,<=50K,0
6,49,160187,9th,Other-service,16,<=50K,0
7,31,45781,Masters,Prof-specialty,50,>50K,1
8,37,280464,Some-college,Exec-managerial,80,>50K,1
9,23,122272,Bachelors,Adm-clerical,30,<=50K,0
10,32,205019,Assoc-acdm,Sales,50,<=50K,0
11,40,121772,Assoc-voc,Craft-repair,40,>50K,1
12,34,245487,7th-8th,Transport-moving,45,<=50K,0
13,25,176756,HS-grad,Farming-fishing,35,<=50K,0
14,32,186824,HS-grad,Machine-op-inspct,40,<=50K,0
15,38,28887,11th,Sales,50,<=50K,0
16,40,193524,Doctorate,Prof-specialty,60,>50K,1
17,54,302146,HS-grad,Other-service,20,<=50K,0
18,35,76845,9th,Farming-fishing,40,<=50K,0
19,43,117037,11th,Transport-moving,40,<=50K,0

In [32]:
occupationDummies = pd.get_dummies(income['occupation'])

In [33]:
income=pd.concat([income, occupationDummies], axis=1)

In [35]:
educationDummies = pd.get_dummies(income['education'])
income=pd.concat([income, educationDummies], axis=1)

In [37]:
income = income.drop('education', axis=1)

In [38]:
income = income.drop('occupation', axis=1)

In [39]:
income.head()

,age,id,hours-per-week,income,01income,?,Adm-clerical,Armed-Forces,Craft-repair,Exec-managerial,...,9th,Assoc-acdm,Assoc-voc,Bachelors,Doctorate,HS-grad,Masters,Preschool,Prof-school,Some-college
0,39,77516,40,<=50K,0,0,1,0,0,0,...,0,0,0,1,0,0,0,0,0,0
1,50,83311,13,<=50K,0,0,0,0,0,1,...,0,0,0,1,0,0,0,0,0,0
2,38,215646,40,<=50K,0,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
3,53,234721,40,<=50K,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,28,338409,40,<=50K,0,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0

In [43]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from matplotlib import pyplot as plt

In [55]:
incomeUse = income.drop(['id', '01income','income'], axis=1)

In [56]:
y = income['01income']

In [59]:
X_train, X_test, y_train, y_test = train_test_split(incomeUse, y, test_size=0.2)

In [60]:
clf = LogisticRegression(random_state=0, solver='lbfgs', multi_class='multinomial').fit(X_train, y_train)

/usr/local/lib/python3.7/site-packages/sklearn/linear_model/logistic.py:758: ConvergenceWarning: lbfgs failed to converge. Increase the number of iterations.
  "of iterations.", ConvergenceWarning)

In [63]:
pred = clf.predict(X_test)

In [65]:
clf.score(X_test, y_test)

0.8692616512480363

In [67]:
from sklearn.ensemble import RandomForestClassifier
clf2 = RandomForestClassifier(n_estimators=100, max_depth=2, random_state=0)

In [68]:
clf2.fit(X_train, y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=2, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=100, n_jobs=None,
            oob_score=False, random_state=0, verbose=0, warm_start=False)

In [69]:
clf2.score(X_test, y_test)

0.8643742363414209

In [72]:
X_test.count()

age                  5729
hours-per-week       5729
?                    5729
Adm-clerical         5729
Armed-Forces         5729
Craft-repair         5729
Exec-managerial      5729
Farming-fishing      5729
Handlers-cleaners    5729
Machine-op-inspct    5729
Other-service        5729
Priv-house-serv      5729
Prof-specialty       5729
Protective-serv      5729
Sales                5729
Tech-support         5729
Transport-moving     5729
10th                 5729
11th                 5729
12th                 5729
1st-4th              5729
5th-6th              5729
7th-8th              5729
9th                  5729
Assoc-acdm           5729
Assoc-voc            5729
Bachelors            5729
Doctorate            5729
HS-grad              5729
Masters              5729
Preschool            5729
Prof-school          5729
Some-college         5729
dtype: int64

In [73]:
x = [0]*5729

In [74]:
from sklearn import metrics

In [76]:
metrics.accuracy_score(x, y_test)

0.8643742363414209